-----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/statalasso_website/static/dofiles/ddml.log
  log type:  text
 opened on:  21 Jan 2023, 20:34:08

. 
. 
. global tol = 0.0001

. which ddml
/Users/kahrens/Library/Application Support/Stata/ado/plus/d/ddml.ado
*! ddml v1.1
*! last edited: 28 dec 2022
*! authors: aa/ms

. which pystacked
/Users/kahrens/MyProjects/pystacked/pystacked.ado
*! pystacked v0.4.9
*! last edited: 27dec2022
*! authors: aa/ms

.    
. * The code below is equivalent to the code from "helpb ddml"
.         
. **** Partially linear model.
. 
. use https://github.com/aahrens1/ddml/raw/master/data/sipp1991.dta, clear

. global Y net_tfa

. global D e401

. global X tw age inc fsize educ db marr twoearn pira hown

. set seed 42

. 
. ddml init partial, kfolds(2)

. 
end of do-file

. help ddml

. use https://github.com/aahrens1/ddml/raw/master/data/sipp1991.dta, clear

. global Y net_tfa

. global D e401

. global X tw age inc fsize educ db marr twoearn pira hown

. set seed 42

. ddml init partial, kfolds(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X]: reg $Y $X
Learner Y1_reg added successfully.

. ddml estimate, robust
ddml model not cross-fitted; call `ddml crossfit` first
r(198);

. ado dir

[1] package sensemakr from http://fmwww.bc.edu/repec/bocode/s
      'SENSEMAKR': module to provide sensitivity tools for OLS

[2] package summclust from http://fmwww.bc.edu/repec/bocode/s
      'SUMMCLUST': module to compute cluster level measures of leverage, influence, and a cluster jackknife variance estimator

[3] package lassopack from http://fmwww.bc.edu/repec/bocode/l
      'LASSOPACK': module for lasso, square-root lasso, elastic net, ridge, adaptive lasso estimation and cross-validation

[4] package pdslasso from http://fmwww.bc.edu/repec/bocode/p
      'PDSLASSO': module for post-selection and post-regularization OLS or IV estimation and inference

[5] package ivreg2 from http://fmwww.bc.edu/repec/bocode/i
      'IVREG2': module for extended instrumental variables/2SLS and GMM estimation

[6] package reghdfe from http://fmwww.bc.edu/repec/bocode/r
      'REGHDFE': module to perform linear or instrumental-variable regression absorbing any number of high-dimensional fixed effects

[7] package ranktest from http://fmwww.bc.edu/repec/bocode/r
      'RANKTEST': module to test the rank of a matrix

[8] package weakiv from http://fmwww.bc.edu/repec/bocode/w
      'WEAKIV': module to perform weak-instrument-robust tests and confidence intervals for instrumental-variable (IV) estimation of linear, probit and tobit mod
> els

[9] package avar from http://fmwww.bc.edu/repec/bocode/a
      'AVAR': module to perform asymptotic covariance estimation for iid and non-iid data robust to heteroskedasticity, autocorrelation, 1- and 2-way clustering,
>  and common cross-panel autocorrelated dis

[10] package mlrtime from https://raw.githubusercontent.com/NickCH-K/mlrtime/master
      'mlrtime': Machine Learning in R... in Stata

[11] package github from https://haghish.github.io/github
      'GITHUB': github package manager

[12] package rcall from https://raw.githubusercontent.com/haghish/rcall/master
      'RCALL': seamless R in Stata

[13] package texsave from http://fmwww.bc.edu/repec/bocode/t
      'TEXSAVE': module to save a dataset in LaTeX format

[14] package regsave from http://fmwww.bc.edu/RePEc/bocode/r
      'REGSAVE': module to save regression results to a Stata-formatted dataset

[15] package texsave from https://raw.githubusercontent.com/reifjulian/texsave/master
      texsave. Save dataset in LaTeX format.

[16] package mivcausal from http://fmwww.bc.edu/repec/bocode/m
      'MIVCAUSAL': module for testing the hypothesis about the signs of the 2SLS weights

[17] package distinct from http://fmwww.bc.edu/repec/bocode/d
      'DISTINCT': module to display distinct values of variables

[18] package hettreatreg from http://fmwww.bc.edu/RePEc/bocode/h
      'HETTREATREG': module to compute diagnostics for linear regression when treatment effects are heterogeneous

[19] package estout from http://fmwww.bc.edu/repec/bocode/e
      'ESTOUT': module to make regression tables

[20] package did_imputation from http://fmwww.bc.edu/repec/bocode/d
      'DID_IMPUTATION': module to perform treatment effect estimation and pre-trend testing in event studies

[21] package svmachines from http://fmwww.bc.edu/repec/bocode/s
      'SVMACHINES': module providing Support Vector Machines for both Classification and Regression

[22] package rforest from http://fmwww.bc.edu/repec/bocode/r
      'RFOREST': module to implement Random Forest algorithm

[23] package sjlatex from http://www.stata-journal.com/production
      sjlatex:  LaTeX files for the Stata Journal

[24] package parsnip2 from https://raw.githubusercontent.com/aahrens1/parsnip2/main
      parsnip2: A simple parsnip wrapper for ddml

[25] package rif from http://fmwww.bc.edu/repec/bocode/r
      'RIF': module to compute Recentered Influence Functions (RIF): RIF-Regression and RIF-Decomposition

[26] package hdfe from http://fmwww.bc.edu/repec/bocode/h
      'HDFE': module to partial out variables with respect to a set of fixed effects

[27] package webdoc from http://fmwww.bc.edu/repec/bocode/w
      'WEBDOC': module to create a HTML or Markdown document including Stata output

[28] package schemepack from https://raw.githubusercontent.com/asjadnaqvi/stata-schemepack/main/installation
      {bf:SCHEMEPACK}: ready-to-use Stata graph schemes.

[29] package grstyle from http://fmwww.bc.edu/repec/bocode/g
      'GRSTYLE': module to customize the overall look of graphs

[30] package coefplot from http://fmwww.bc.edu/repec/bocode/c
      'COEFPLOT': module to plot regression coefficients and other results

[31] package ftools from https://github.com/sergiocorreia/ftools/raw/master/src
      ftools. Alternatives to common Stata commands optimized for large datasets

[32] package ddml from https://raw.githubusercontent.com/aahrens1/ddml/dev
      ddml: Package for Double Debiased Machine Learning

. ddml update
checking ddml consistency and verifying not already installed...

the following files will be replaced:
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_allcombos.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_copy.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_crossfit.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_describe.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_drop.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_estimate_ate_late.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_estimate_linear.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_export.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_extract.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_nnls.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_nnls_p.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_overlap.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_sample.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_save.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/_/_ddml_use.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/c/crossfit.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/c/crossfit.sthlp
    /Users/kahrens/Library/Application Support/Stata/ado/plus/d/ddml.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/d/ddml.sthlp
    /Users/kahrens/Library/Application Support/Stata/ado/plus/d/ddml_extract.sthlp
    /Users/kahrens/Library/Application Support/Stata/ado/plus/q/qddml.ado
    /Users/kahrens/Library/Application Support/Stata/ado/plus/q/qddml.sthlp

installing into /Users/kahrens/Library/Application Support/Stata/ado/plus/...
installation complete.

. help ddml

. use https://github.com/aahrens1/ddml/raw/master/data/sipp1991.dta, clear

. global Y net_tfa

. global D e401

. global X tw age inc fsize educ db marr twoearn pira hown

. set seed 42

. ddml init partial, kfolds(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X]: reg $Y $X
Learner Y1_reg added successfully.

. ddml E[Y|X]: pystacked $Y $X, type(reg) method(rf)
Learner Y2_pystacked added successfully.

. ddml E[D|X]: reg $D $X
Learner D1_reg added successfully.

. ddml E[D|X]: pystacked $D $X, type(reg) method(rf)
Learner D2_pystacked added successfully.

. ddml desc

Model:                  partial, crossfit folds k=2, resamples r=1
Dependent variable (Y): net_tfa
 net_tfa learners:      Y1_reg Y2_pystacked
D equations (1):        e401
 e401 learners:         D1_reg D2_pystacked
Specifications:         4 possible specs

. ddml estimate, robust
ddml model not cross-fitted; call `ddml crossfit` first
r(198);

. ddml crossfit
Cross-fitting E[y|X] equation: net_tfa
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: e401
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate, robust

DDML estimation results:
spec  r     Y learner     D learner         b        SE
 opt  1  Y2_pystacked        D1_reg  7044.518(1126.896)
opt = minimum MSE specification for that resample.

Min MSE DDML model
y-E[y|X]  = Y2_pystacked_1                         Number of obs   =      9915
D-E[D|X,Z]= D1_reg_1
------------------------------------------------------------------------------
             |               Robust
     net_tfa | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        e401 |   7044.518   1126.896     6.25   0.000     4835.843    9253.193
       _cons |  -317.8379   352.8666    -0.90   0.368    -1009.444     373.768
------------------------------------------------------------------------------


. ddml estimate, robust allcombos

DDML estimation results:
spec  r     Y learner     D learner         b        SE
   1  1        Y1_reg        D1_reg  5397.208(1130.776)
   2  1        Y1_reg  D2_pystacked  6705.740 (878.656)
*  3  1  Y2_pystacked        D1_reg  7044.518(1126.896)
   4  1  Y2_pystacked  D2_pystacked  6979.699 (753.471)
* = minimum MSE specification for that resample.

Min MSE DDML model
y-E[y|X]  = Y2_pystacked_1                         Number of obs   =      9915
D-E[D|X,Z]= D1_reg_1
------------------------------------------------------------------------------
             |               Robust
     net_tfa | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        e401 |   7044.518   1126.896     6.25   0.000     4835.843    9253.193
       _cons |  -317.8379   352.8666    -0.90   0.368    -1009.444     373.768
------------------------------------------------------------------------------


. ddml estimate, robust spec(1) replay

DDML estimation results:
spec  r     Y learner     D learner         b        SE
 opt  1  Y2_pystacked        D1_reg  7044.518(1126.896)
opt = minimum MSE specification for that resample.

DDML model, specification 1
y-E[y|X]  = Y1_reg_1                               Number of obs   =      9915
D-E[D|X,Z]= D1_reg_1
------------------------------------------------------------------------------
             |               Robust
     net_tfa | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        e401 |   5397.208   1130.776     4.77   0.000     3180.928    7613.488
       _cons |   -104.854   397.9023    -0.26   0.792     -884.728    675.0201
------------------------------------------------------------------------------


. reg Y1_reg D1_reg, robust

Linear regression                               Number of obs     =      9,915
                                                F(1, 9913)        =      22.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0037
                                                Root MSE          =      39628

------------------------------------------------------------------------------
             |               Robust
    Y1_reg_1 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    D1_reg_1 |   5397.208   1130.776     4.77   0.000     3180.657    7613.759
       _cons |   -104.854   397.9023    -0.26   0.792    -884.8233    675.1154
------------------------------------------------------------------------------

. ddml update
checking ddml consistency and verifying not already installed...

the following files will be replaced:
    /Users/kahrens/Library/Application Support/Stata/ado/plus/d/ddml.sthlp

installing into /Users/kahrens/Library/Application Support/Stata/ado/plus/...
installation complete.

. help ddml'

. set seed 42

. ddml init partial, kfolds(2) reps(5) mname(m1)

. global rflow max_features(5) min_samples_leaf(1) max_samples(.7)

. global rfhigh max_features(5) min_samples_leaf(10) max_samples(.7)

. ddml E[Y|X], mname(m1) learner(Y_m1): pystacked $Y $X || method(ols) || method(lassocv) || method(ridgecv) || method(rf) opt($rflow) || method(rf) opt($rfhigh)
> , type(reg)
Learner Y_m1 added successfully.

. ddml E[D|X], mname(m1) learner(D_m1): pystacked $D $X || method(ols) || method(lassocv) || method(ridgecv) || method(rf) opt($rflow) || method(rf) opt($rfhigh)
> , type(reg)
Learner D_m1 added successfully.

. ddml desc, mname(m1) learners

Model:                  partial, crossfit folds k=2, resamples r=5
Dependent variable (Y): net_tfa
 net_tfa learners:      Y_m1
D equations (1):        e401
 e401 learners:         D_m1
Specifications:         1 possible specs * 5 crossfit splits = 5

Y learners (detail):
 Learner:     Y_m1
              est cmd: pystacked net_tfa tw age inc fsize educ db marr twoearn pira hown || method(ols) || method(lassocv) || method(ridgecv) || method(rf) opt(m
> ax_features(5) min_samples_leaf(1) max_samples(.7)) || method(rf) opt(max_features(5) min_samples_leaf(10) max_samples(.7)), type(reg)
D learners (detail):
 Learner:     D_m1
              est cmd: pystacked e401 tw age inc fsize educ db marr twoearn pira hown || method(ols) || method(lassocv) || method(ridgecv) || method(rf) opt(max_
> features(5) min_samples_leaf(1) max_samples(.7)) || method(rf) opt(max_features(5) min_samples_leaf(10) max_samples(.7)), type(reg)

. ddml crossfit, mname(m1)
Cross-fitting E[y|X] equation: net_tfa
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 4...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 5...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: e401
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 4...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 5...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate, mname(m1) robust

DDML estimation results:
spec  r     Y learner     D learner         b        SE
 opt  1          Y_m1          D_m1  7362.283 (937.426)
 opt  2          Y_m1          D_m1  6958.283 (899.946)
 opt  3          Y_m1          D_m1  6531.201 (872.895)
 opt  4          Y_m1          D_m1  6532.662 (952.414)
 opt  5          Y_m1          D_m1  6672.368 (981.239)
opt = minimum MSE specification for that resample.

Mean/med.   Y learner     D learner         b        SE
 mse mn     [min-mse]         [mse]  6811.360 (973.863)
 mse md     [min-mse]         [mse]  6672.368 (962.606)

Median over min-mse specifications
y-E[y|X]  = Y_m1                                   Number of obs   =      9915
D-E[D|X,Z]= D_m1
------------------------------------------------------------------------------
             |               Robust
     net_tfa | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        e401 |   6672.368   962.6062     6.93   0.000     4785.695    8559.042
------------------------------------------------------------------------------

Summary over 5 resamples:
       D eqn      mean       min       p25       p50       p75       max
        e401   6811.3596 6531.2007 6532.6626 6672.3682 6958.2832 7362.2832

. ddml extract, mname(m1) show(pystacked)

mean pystacked weights across folds/resamples for D_m1 (e401)
             learner  mean_weight
    ols            1    .03041657
lassocv            2    .20534919
ridgecv            3    .09881965
     rf            4    3.469e-18
     rf            5    .66541459

mean pystacked MSEs across folds/resamples for D_m1 (e401)
           learner   mean_MSE
    ols          1  .20129712
lassocv          2  .20124102
ridgecv          3  .20129712
     rf          4  .20613372
     rf          5  .19766838

mean pystacked weights across folds/resamples for Y_m1 (net_tfa)
             learner  mean_weight
    ols            1    .10411229
lassocv            2    .07037434
ridgecv            3    .11111124
     rf            4      .739886
     rf            5    .02652244

mean pystacked MSEs across folds/resamples for Y_m1 (net_tfa)
           learner   mean_MSE
    ols          1  1.614e+09
lassocv          2  1.617e+09
ridgecv          3  1.614e+09
     rf          4  1.425e+09
     rf          5  1.816e+09

. ddml extract, mname(m1) show(mse)

MSEs for e401:
                 rep   full smp      fold 1      fold 2 
            D_m1   1      0.196       0.193       0.200  
            D_m1   2      0.196       0.195       0.197  
            D_m1   3      0.196       0.198       0.194  
            D_m1   4      0.197       0.195       0.199  
            D_m1   5      0.195       0.198       0.193  

MSEs for net_tfa:
                 rep   full smp      fold 1      fold 2 
            Y_m1   1  1.289e+09   1.261e+09   1.317e+09  
            Y_m1   2  1.294e+09   1.160e+09   1.428e+09  
            Y_m1   3  1.287e+09   1.176e+09   1.397e+09  
            Y_m1   4  1.467e+09   1.318e+09   1.616e+09  
            Y_m1   5  1.483e+09   1.664e+09   1.302e+09  

. ddml estimate, mname(m0) replay

DDML estimation results:
spec  r     Y learner     D learner         b        SE
 opt  1  Y2_pystacked        D1_reg  7044.518(1126.896)
opt = minimum MSE specification for that resample.

Min MSE DDML model
y-E[y|X]  = Y2_pystacked_1                         Number of obs   =      9915
D-E[D|X,Z]= D1_reg_1
------------------------------------------------------------------------------
             |               Robust
     net_tfa | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        e401 |   7044.518   1126.896     6.25   0.000     4835.843    9253.193
       _cons |  -317.8379   352.8666    -0.90   0.368    -1009.444     373.768
------------------------------------------------------------------------------


. webuse cattaneo2, clear
(Excerpt from Cattaneo (2010) Journal of Econometrics 155: 138–154)

. global Y bweight

. global D mbsmoke

. global X prenatal1 mmarried fbaby mage medu

. set seed 42

. ddml init interactive, kfolds(5) reps(5)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,D]: pystacked $Y $X, type(reg) methods(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X]: pystacked $D $X, type(class) methods(logit gradboost)
Learner D1_pystacked added successfully.

. ddml crossfit
Cross-fitting E[y|X,D] equation: bweight
Resample 1...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Resample 3...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Resample 4...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Resample 5...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Cross-fitting E[D|X] equation: mbsmoke
Resample 1...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Resample 3...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Resample 4...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Resample 5...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting

. ddml estimate

DDML estimation results (ATE):
spec  r    Y0 learner    Y1 learner     D learner         b        SE
 opt  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -219.583  (26.027)
 opt  2  Y1_pystacked  Y1_pystacked  D1_pystacked  -220.967  (25.586)
 opt  3  Y1_pystacked  Y1_pystacked  D1_pystacked  -227.103  (26.256)
 opt  4  Y1_pystacked  Y1_pystacked  D1_pystacked  -221.207  (25.830)
 opt  5  Y1_pystacked  Y1_pystacked  D1_pystacked  -224.497  (25.840)
opt = minimum MSE specification for that resample.

Mean/med.  Y0 learner    Y1 learner     D learner         b        SE
 mse mn     [min-mse]         [mse]         [mse]  -222.672  (26.045)
 mse md     [min-mse]         [mse]         [mse]  -221.207  (26.049)

Median over 5 min-mse specifications (ATE)
E[y|X,D=0]   = Y1_pystacked                        Number of obs   =      4642
E[y|X,D=1]   = Y1_pystacked
E[D|X]       = D1_pystacked
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -221.2069    26.0486    -8.49   0.000    -272.2612   -170.1526
------------------------------------------------------------------------------

Summary over 5 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -222.6716 -227.1032 -224.4971 -221.2069 -220.9675 -219.5831

. use http://fmwww.bc.edu/repec/bocode/j/jtpa.dta, clear

. global Y earnings

. global D training

. webuse cattaneo2, clear
(Excerpt from Cattaneo (2010) Journal of Econometrics 155: 138–154)

. global Y bweight

. global D mbsmoke

. global X prenatal1 mmarried fbaby mage medu

. set seed 42

. ddml init interactive, kfolds(5) reps(5)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,D]: reg $Y $X
Learner Y1_reg added successfully.

. ddml E[Y|X,D]: pystacked $Y $X, type(reg) method(gradboost)
Learner Y2_pystacked added successfully.

. ddml E[D|X]: logit $D $X
Learner D1_logit added successfully.

. ddml E[D|X]: pystacked $D $X, type(class) method(gradboost)
Learner D2_pystacked added successfully.

. ddml crossfit, shortstack
Cross-fitting E[y|X,D] equation: bweight
Resample 1...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Resample 2...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Resample 3...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Resample 4...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Resample 5...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X] equation: mbsmoke
Resample 1...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Resample 2...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Resample 3...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Resample 4...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Resample 5...
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking

. webuse cattaneo2, clear
(Excerpt from Cattaneo (2010) Journal of Econometrics 155: 138–154)

. use http://fmwww.bc.edu/repec/bocode/j/jtpa.dta, clear

. global Y earnings

. global D training

. global Z assignmt

. global X sex age married black hispanic

. set seed 42

. ddml init interactiveiv, kfolds(5)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,Z]: pystacked $Y c.($X)# #c($X), type(reg) m(ols lassocv)
Learner Y1_pystacked added successfully.

. ddml E[D|X,Z]: pystacked $D c.($X)# #c($X), type(class) m(logit lassocv)
Learner D1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z c.($X)# #c($X), type(class) m(logit lassocv)
Learner Z1_pystacked added successfully.

. ddml crossfit
Cross-fitting E[y|X,Z] equation: earnings
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting

. ddml estimate

DDML estimation results (LATE):
spec  r    Y0 learner    Y1 learner    D0 learner    D1 learner         b        SE     Z learner
 opt  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked  1817.206 (512.772)  Z1_pystacked
opt = minimum MSE specification for that resample.


E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =     11204
E[y|X,D=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
    earnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   1817.206   512.7723     3.54   0.000     812.1911    2822.221
------------------------------------------------------------------------------


. set seed 42

. ddml init interactiveiv, kfolds(5)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,Z]: reg $Y $X
Learner Y1_reg added successfully.

. ddml E[Y|X,Z]: pystacked $Y c.($X)# #c($X), type(reg) m(lassocv)
Learner Y2_pystacked added successfully.

. ddml E[D|X,Z]: logit $D $X
Learner D1_logit added successfully.

. ddml E[D|X,Z]: pystacked $D c.($X)# #c($X), type(class) m(lassocv)
Learner D2_pystacked added successfully.

. ddml E[Z|X]: logit $Z $X
Learner Z1_logit added successfully.

. ddml E[Z|X]: pystacked $Z c.($X)# #c($X), type(class) m(lassocv)
Learner Z2_pystacked added successfully.

. ddml crossfit, shortstack
Cross-fitting E[y|X,Z] equation: earnings
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X,Z] equation: training
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking
Cross-fitting E[Z|X]: assignmt
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting...completed short-stacking

. ddml estimate, robust

DDML estimation results (LATE):
spec  r    Y0 learner    Y1 learner    D0 learner    D1 learner         b        SE     Z learner
 opt  1  Y2_pystacked  Y2_pystacked      D1_logit  D2_pystacked  1824.422 (514.303)  Z2_pystacked
  ss  1  [shortstack]          [ss]          [ss]          [ss]  1818.488 (513.133)          [ss]
opt = minimum MSE specification for that resample.

Shortstack DDML model (LATE)
E[y|X,D=0]   = earnings_ss0_1                      Number of obs   =     11204
E[y|X,D=1]   = earnings_ss1_1
E[D|X,Z=0]   = training_ss0_1
E[D|X,Z=1]   = training_ss1_1
E[Z|X]       = assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
    earnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   1818.488    513.133     3.54   0.000     812.7663    2824.211
------------------------------------------------------------------------------


. use https://statalasso.github.io/dta/AJR.dta, clear

. global Y logpgp95

. global D avexpr

. global Z logem4

. global X lat_abst edes1975 avelf temp* humid* steplow-oilres

. set seed 42

. ddml init iv, kfolds(30)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X]: reg $Y $X
Learner Y1_reg added successfully.

. ddml E[Y|X], vtype(none): rforest $Y $X, type(reg)
Learner Y2_rforest added successfully.

. ddml E[D|X]: reg $D $X
Learner D1_reg added successfully.

. ddml E[D|X], vtype(none): rforest $D $X, type(reg)
Learner D2_rforest added successfully.

. ddml E[Z|X]: reg $Z $X
Learner Z1_reg added successfully.

. ddml E[Z|X], vtype(none): rforest $Z $X, type(reg)
Learner Z2_rforest added successfully.

. ddml crossfit, shortstack
Cross-fitting E[y|X] equation: logpgp95
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X] equation: avexpr
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 ...completed cross-fitting...completed short-stacking
Cross-fitting E[Z|X]: logem4
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 ...completed cross-fitting...completed short-stacking

. ddml estimate, robust

DDML estimation results:
spec  r     Y learner     D learner         b        SE     Z learner
 opt  1    Y2_rforest    D2_rforest     0.772  ( 0.207)              
  ss  1  [shortstack]          [ss]     0.716  ( 0.196)          [ss]
opt = minimum MSE specification for that resample.

Shortstack DDML model
y-E[y|X]  = logpgp95_ss_1                          Number of obs   =        64
D-E[D|X,Z]= avexpr_ss_1
Z-E[Z|X]  = logem4_ss_1
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .7158468   .1958356     3.66   0.000     .3320162    1.099677
       _cons |  -.0308525   .0914993    -0.34   0.736    -.2101878    .1484828
------------------------------------------------------------------------------


. ddml estimate, allcombos spec(8) rep(1) robust

DDML estimation results:
spec  r     Y learner     D learner         b        SE     Z learner
   1  1        Y1_reg        D1_reg     0.378  ( 0.125)        Z1_reg
   2  1        Y1_reg        D1_reg    -0.187  ( 1.573)    Z2_rforest
   3  1        Y1_reg    D2_rforest     2.413  ( 3.594)        Z1_reg
   4  1        Y1_reg    D2_rforest     0.083  ( 0.475)    Z2_rforest
   5  1    Y2_rforest        D1_reg     0.123  ( 0.207)        Z1_reg
   6  1    Y2_rforest        D1_reg    -1.749  ( 4.690)    Z2_rforest
   7  1    Y2_rforest    D2_rforest     0.783  ( 0.504)        Z1_reg
*  8  1    Y2_rforest    D2_rforest     0.772  ( 0.207)    Z2_rforest
  ss  1  [shortstack]          [ss]     0.716  ( 0.196)          [ss]
* = minimum MSE specification for that resample.

Min MSE DDML model, specification 8
y-E[y|X]  = Y2_rforest_1                           Number of obs   =        64
D-E[D|X,Z]= D2_rforest_1
Z-E[Z|X]  = Z2_rforest_1
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |    .772314   .2068282     3.73   0.000     .3669382     1.17769
       _cons |  -.0119092   .1009289    -0.12   0.906    -.2097263    .1859079
------------------------------------------------------------------------------


. ivreg Y2_rf (D2_rf = Z2_rf), robust

Instrumental variables 2SLS regression          Number of obs     =         64
                                                F(1, 62)          =      13.94
                                                Prob > F          =     0.0004
                                                R-squared         =          .
                                                Root MSE          =     .80209

------------------------------------------------------------------------------
             |               Robust
Y2_rforest_1 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
D2_rforest_1 |    .772314   .2068282     3.73   0.000     .3588703    1.185758
       _cons |  -.0119092   .1009289    -0.12   0.906    -.2136633    .1898448
------------------------------------------------------------------------------
Instrumented: D2_rforest_1
 Instruments: Z2_rforest_1

. use https://github.com/aahrens1/ddml/raw/master/data/BLP.dta, clear

. global Y share

. global D price

. global X hpwt air mpd space

. global Z sum*

. set seed 42

. ddml init fiv
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X]: reg $Y $X
Learner Y1_reg added successfully.

. ddml E[Y|X]: pystacked $Y $X, type(reg)
Learner Y2_pystacked added successfully.

. ddml E[D|Z,X], learner(Dhat_reg): reg $D $X $Z
Learner Dhat_reg added successfully.

. ddml E[D|Z,X], learner(Dhat_pystacked): pystacked $D $X $Z, type(reg)
Learner Dhat_pystacked added successfully.

. ddml E[D|X], learner(Dhat_reg) vname($D): reg {D} $X
Learner Dhat_reg_h added successfully.

. ddml E[D|X], learner(Dhat_pystacked) vname($D): pystacked {D} $X, type(reg)
Replacing existing learner Dhat_pystacked_h...
Learner Dhat_pystacked_h added successfully.

. ddml crossfit
Cross-fitting E[y|X,Z] equation: share
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting
Cross-fitting E[D|X,Z] and E[D|X] equation: price
Cross-fitting fold 1 2 3 4 5 ...completed cross-fitting

. ddml estimate, robust

DDML estimation results:
spec  r     Y learner     D learner         b        SE    DH learner
 opt  1  Y2_pystacked Dhat_pystac~d    -0.098  ( 0.008) Dhat_pystac~h
opt = minimum MSE specification for that resample.

Min MSE DDML model
y-E[y|X]  = Y2_pystacked_1                         Number of obs   =      2217
E[D|X,Z]  = Dhat_pystacked_1
E[D|X]    = Dhat_pystacked_h_1
Orthogonalised D = D - E[D|X]; optimal IV = E[D|X,Z] - E[D|X].
------------------------------------------------------------------------------
             |               Robust
       share | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       price |  -.0979042   .0075006   -13.05   0.000     -.112605   -.0832033
       _cons |   .0033532   .0215627     0.16   0.876    -.0389089    .0456154
------------------------------------------------------------------------------


. ddml estimate, allcombos spec(8) rep(1) robust

DDML estimation results:
spec  r     Y learner     D learner         b        SE    DH learner
   1  1        Y1_reg      Dhat_reg    -0.137  ( 0.012)    Dhat_reg_h
   2  1        Y1_reg      Dhat_reg     0.369  ( 0.207) Dhat_pystac~h
   3  1        Y1_reg Dhat_pystac~d    -0.089  ( 0.005)    Dhat_reg_h
   4  1        Y1_reg Dhat_pystac~d    -0.114  ( 0.009) Dhat_pystac~h
   5  1  Y2_pystacked      Dhat_reg    -0.096  ( 0.011)    Dhat_reg_h
   6  1  Y2_pystacked      Dhat_reg    -0.212  ( 0.087) Dhat_pystac~h
   7  1  Y2_pystacked Dhat_pystac~d    -0.042  ( 0.004)    Dhat_reg_h
*  8  1  Y2_pystacked Dhat_pystac~d    -0.098  ( 0.008) Dhat_pystac~h
* = minimum MSE specification for that resample.

Min MSE DDML model, specification 8
y-E[y|X]  = Y2_pystacked_1                         Number of obs   =      2217
E[D|X,Z]  = Dhat_pystacked_1
E[D|X]    = Dhat_pystacked_h_1
Orthogonalised D = D - E[D|X]; optimal IV = E[D|X,Z] - E[D|X].
------------------------------------------------------------------------------
             |               Robust
       share | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       price |  -.0979042   .0075006   -13.05   0.000     -.112605   -.0832033
       _cons |   .0033532   .0215627     0.16   0.876    -.0389089    .0456154
------------------------------------------------------------------------------


. gen Dtilde = $D - Dhat_pystacked_h_1

. gen Zopt = Dhat_pystacked_1 - Dhat_pystacked_h_1

. ivreg Y2_pystacked_1 (Dtilde=Zopt), robust

Instrumental variables 2SLS regression          Number of obs     =      2,217
                                                F(1, 2215)        =     170.38
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1175
                                                Root MSE          =     1.0152

------------------------------------------------------------------------------
             |               Robust
Y2_pystack~1 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      Dtilde |  -.0979042   .0075006   -13.05   0.000    -.1126131   -.0831953
       _cons |   .0033532   .0215627     0.16   0.876     -.038932    .0456385
------------------------------------------------------------------------------
Instrumented: Dtilde
 Instruments: Zopt

. webdoc do "/Users/kahrens/MyProjects/sthlp_to_md/sthlp_to_md.do"

. 
. cd /Users/kahrens/MyProjects/sthlp_to_md
/Users/kahrens/MyProjects/sthlp_to_md

. 
. webdoc init ddml_help, replace 
(webdoc output file is ddml_help.html)

. webdoc stlog using "qddml.sthlp", sthlp
(log-file written to ddml_help_1.log)

. 
. webdoc init ddml_help, replace 
(webdoc output file is ddml_help.html)

. webdoc stlog using "ddml.sthlp", sthlp
(log-file written to ddml_help_1.log)

. 
. /*
> webdoc init pystacked_help, replace 
> webdoc stlog using "pystacked.sthlp", sthlp
> 
> webdoc init ivlasso_help, replace 
> webdoc stlog using "ivlasso.ihlp", sthlp
> 
> webdoc init pystacked_help, replace 
> webdoc stlog using "pystacked.sthlp", sthlp
> 
> webdoc init lassologit_help, replace 
> webdoc stlog using "lassologit.ihlp", sthlp
> 
> webdoc init cvlasso_help, replace 
> webdoc stlog using "cvlasso.sthlp", sthlp
> 
> webdoc init lasso2_help, replace 
> webdoc stlog using "lasso2.sthlp", sthlp 
> 
> webdoc init rlasso_help, replace 
> webdoc stlog using "rlasso.sthlp", sthlp
> 
> webdoc init rlasso_help, replace 
> webdoc stlog using "ddml.sthlp", sthlp

end of do-file
(webdoc output written to ddml_help.html)

. webdoc do "/Users/kahrens/MyProjects/sthlp_to_md/sthlp_to_md.do"

. 
. cd /Users/kahrens/MyProjects/sthlp_to_md
/Users/kahrens/MyProjects/sthlp_to_md

. 
. webdoc init qddml_help, replace 
(webdoc output file is qddml_help.html)

. webdoc stlog using "qddml.sthlp", sthlp
(log-file written to qddml_help_1.log)

. 
. webdoc init ddml_help, replace 
(webdoc output file is ddml_help.html)

. webdoc stlog using "ddml.sthlp", sthlp
(log-file written to ddml_help_1.log)

. 
. /*
> webdoc init pystacked_help, replace 
> webdoc stlog using "pystacked.sthlp", sthlp
> 
> webdoc init ivlasso_help, replace 
> webdoc stlog using "ivlasso.ihlp", sthlp
> 
> webdoc init pystacked_help, replace 
> webdoc stlog using "pystacked.sthlp", sthlp
> 
> webdoc init lassologit_help, replace 
> webdoc stlog using "lassologit.ihlp", sthlp
> 
> webdoc init cvlasso_help, replace 
> webdoc stlog using "cvlasso.sthlp", sthlp
> 
> webdoc init lasso2_help, replace 
> webdoc stlog using "lasso2.sthlp", sthlp 
> 
> webdoc init rlasso_help, replace 
> webdoc stlog using "rlasso.sthlp", sthlp
> 
> webdoc init rlasso_help, replace 
> webdoc stlog using "ddml.sthlp", sthlp

end of do-file
(webdoc output written to ddml_help.html)

