------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/statalasso_website/static/dofiles/single_case.log
  log type:  text
 opened on:  27 Nov 2022, 13:08:51

. 
. insheet using ///
>                 https://statalasso.github.io/dta/housing.csv,  ///
>                 clear comma
(14 vars, 506 obs)

.                 
. set seed 789

. gen train=runiform()

. replace train=train>.75
(506 real changes made)

. 
. set seed 42

. 
. pystacked medv crim-lstat if train, ///
>         type(regress) method(gradboost)
Single base learner: no stacking done.

Stacking weights:
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  gradboost      |      1.0000000

. predict double ygb if !train

. 
. _pyparse, type(reg) method(gradboost) print
Default options: 
loss(squared_error) learning_rate(.1) n_estimators(100) subsample(1) criterion(friedman_mse) min_samples_split(2) min_sa
> mples_leaf(1) 
min_weight_fraction_leaf(0) max_depth(3) min_impurity_decrease(0) init(None) random_state(rng) max_features(None) alpha(
> .9) 
max_leaf_nodes(None) warm_start(False) validation_fraction(.1) n_iter_no_change(None) tol(.0001) ccp_alpha(0) 
. 
. pystacked medv crim-lstat if train, ///
>         type(regress) method(gradboost) ///
>         cmdopt1(learning_rate(.01))
Single base learner: no stacking done.

Stacking weights:
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  gradboost      |      1.0000000

. predict double ygb2 if !train

. 
. pystacked medv crim-lstat if train, ///
>         type(regress) pyseed(243) method(gradboost) ///
>         cmdopt1(learning_rate(.01) n_estimators(1000))
Single base learner: no stacking done.

Stacking weights:
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  gradboost      |      1.0000000

. predict double ygb3 if !train

. 
. pystacked, table holdout
Number of holdout observations:  361

RMSPE: In-Sample, CV, Holdout
-----------------------------------------------------------------
  Method         | Weight   In-Sample        CV         Holdout
-----------------+-----------------------------------------------
  STACKING       |    .            .            .        3.654
  gradboost      | 1.000       0.637            .        3.654

. 
. gen double rgb_sq=(medv-ygb)^2 if  !train
(145 missing values generated)

. gen double rgb2_sq=(medv-ygb2)^2 if  !train
(145 missing values generated)

. gen double rgb3_sq=(medv-ygb3)^2 if !train
(145 missing values generated)

. sum rgb* if!train

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      rgb_sq |        361    14.19902    38.15371   .0000138   469.2815
     rgb2_sq |        361    28.66256    50.82527   .0019822   437.9858
     rgb3_sq |        361    13.38564    38.00065   8.70e-07   546.1962

. 
. pystacked medv crim-lstat if train, ///
>         type(regress) method(lassocv)  
Single base learner: no stacking done.

Stacking weights:
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  lassocv        |      1.0000000

. predict double ylasso1 if !train

. 
. pystacked medv crim-lstat if train, ///
>         type(regress) method(lassocv) ///
>         pipe1(poly2)
Single base learner: no stacking done.

Stacking weights:
---------------------------------------
  Method         |      Weight
-----------------+---------------------
  lassocv        |      1.0000000

. predict double ylasso2 if !train

. 
. gen double rlasso1_sq=(medv-ylasso1)^2
(145 missing values generated)

. gen double rlasso2_sq=(medv-ylasso2)^2
(145 missing values generated)

. sum *sq if!train

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      rgb_sq |        361    14.19902    38.15371   .0000138   469.2815
     rgb2_sq |        361    28.66256    50.82527   .0019822   437.9858
     rgb3_sq |        361    13.38564    38.00065   8.70e-07   546.1962
  rlasso1_sq |        361    28.03915    76.37714   .0006696   897.5598
  rlasso2_sq |        361    22.85806    76.73137   4.81e-06   952.1228

. 
. pystacked, table holdout
Number of holdout observations:  361

RMSPE: In-Sample, CV, Holdout
-----------------------------------------------------------------
  Method         | Weight   In-Sample        CV         Holdout
-----------------+-----------------------------------------------
  STACKING       |    .            .            .        4.777
  lassocv        | 1.000       3.547            .        4.777

. 
. log close
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/statalasso_website/static/dofiles/single_case.log
  log type:  text
 closed on:  27 Nov 2022, 13:08:56
------------------------------------------------------------------------------------------------------------------------
